zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32e103t(b-8)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32e103xx-afio.h"

/* ADC01_IN0 */
#define ADC01_IN0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)

/* ADC01_IN1 */
#define ADC01_IN1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)

/* ADC01_IN2 */
#define ADC01_IN2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)

/* ADC01_IN3 */
#define ADC01_IN3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)
#define ANALOG_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)
#define ANALOG_PA10 \
	GD32_PINMUX_AFIO('A', 10, ANALOG, NORMP)
#define ANALOG_PA11 \
	GD32_PINMUX_AFIO('A', 11, ANALOG, NORMP)
#define ANALOG_PA12 \
	GD32_PINMUX_AFIO('A', 12, ANALOG, NORMP)
#define ANALOG_PA13 \
	GD32_PINMUX_AFIO('A', 13, ANALOG, NORMP)
#define ANALOG_PA14 \
	GD32_PINMUX_AFIO('A', 14, ANALOG, NORMP)
#define ANALOG_PA15 \
	GD32_PINMUX_AFIO('A', 15, ANALOG, NORMP)
#define ANALOG_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)
#define ANALOG_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)
#define ANALOG_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)
#define ANALOG_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)
#define ANALOG_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)
#define ANALOG_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)
#define ANALOG_PA8 \
	GD32_PINMUX_AFIO('A', 8, ANALOG, NORMP)
#define ANALOG_PA9 \
	GD32_PINMUX_AFIO('A', 9, ANALOG, NORMP)
#define ANALOG_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)
#define ANALOG_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)
#define ANALOG_PB2 \
	GD32_PINMUX_AFIO('B', 2, ANALOG, NORMP)
#define ANALOG_PB3 \
	GD32_PINMUX_AFIO('B', 3, ANALOG, NORMP)
#define ANALOG_PB4 \
	GD32_PINMUX_AFIO('B', 4, ANALOG, NORMP)
#define ANALOG_PB5 \
	GD32_PINMUX_AFIO('B', 5, ANALOG, NORMP)
#define ANALOG_PB6 \
	GD32_PINMUX_AFIO('B', 6, ANALOG, NORMP)
#define ANALOG_PB7 \
	GD32_PINMUX_AFIO('B', 7, ANALOG, NORMP)
#define ANALOG_PD0 \
	GD32_PINMUX_AFIO('D', 0, ANALOG, NORMP)
#define ANALOG_PD1 \
	GD32_PINMUX_AFIO('D', 1, ANALOG, NORMP)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_MISO_PB4_INP_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)
#define SPI0_MISO_PB4_OUT_RMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, SPI0_NORMP)
#define SPI0_MOSI_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_INP_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI0_RMP)
#define SPI0_MOSI_PB5_OUT_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_NSS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_INP_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI0_RMP)
#define SPI0_NSS_PA15_OUT_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, SPI0_NORMP)
#define SPI0_SCK_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_INP_RMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI0_RMP)
#define SPI0_SCK_PB3_OUT_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)

/* TIMER1_CH0_ETI */
#define TIMER1_CH0_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_INP_NORMP \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PB6_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_INP_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PB7_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0_INP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
#define TIMER4_CH0_PA0_OUT \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1_INP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)
#define TIMER4_CH1_PA1_OUT \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2_INP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)
#define TIMER4_CH2_PA2_OUT \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3_INP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)
#define TIMER4_CH3_PA3_OUT \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)

/* USBFS_DM */
#define USBFS_DM_PA11_INP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)
#define USBFS_DM_PA11_OUT \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBFS_DP */
#define USBFS_DP_PA12_INP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)
#define USBFS_DP_PA12_OUT \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBFS_ID */
#define USBFS_ID_PA10_INP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, NORMP)
#define USBFS_ID_PA10_OUT \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBFS_VBUS */
#define USBFS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
